# Radius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IConnector..::..Radius Property
IConnector Interface See Also
---
The radius of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
double Radius { get; }
```

Visual Basic
---
```text
ReadOnly Property Radius As Double
	Get
```

Visual C++
---
```text
property double Radius {
	double get ();
}
```

# Remarks
This property is used to retrieve the radius of the connector.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the connector's shape is not round. |

# See Also
IConnector Interface
Autodesk.Revit.DB Namespace